In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.1.4'

In [3]:
# yellow_taxi_data / green_taxi_data
taxi_table_name='yellow_taxi_data' 
zones_table_name='zones'

## Ingest Taxi table

In [4]:
# !wget "https://github.com/DataTalksClub/nyc-tlc-data/releases/download/yellow/yellow_tripdata_2021-01.csv.gz"

In [5]:
df = pd.read_csv('yellow_tripdata_2021-01.csv.gz', nrows=100, compression='gzip')

In [6]:
df.tpep_pickup_datetime = pd.to_datetime(df.tpep_pickup_datetime)
df.tpep_dropoff_datetime = pd.to_datetime(df.tpep_dropoff_datetime)

In [7]:
from sqlalchemy import create_engine

In [8]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [9]:
print(pd.io.sql.get_schema(df, name=taxi_table_name, con=engine))

CREATE TABLE yellow_taxi_data (
	"VendorID" BIGINT,
	tpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	tpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	"RatecodeID" BIGINT,
	store_and_fwd_flag TEXT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	payment_type BIGINT,
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [10]:
# low_memory=False after error message when ingesting:
# "DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.""
df_iter = pd.read_csv('yellow_tripdata_2021-01.csv', iterator=True, chunksize=100000, low_memory=False)

In [11]:
df.tpep_pickup_datetime = pd.to_datetime(df.tpep_pickup_datetime)
df.tpep_dropoff_datetime = pd.to_datetime(df.tpep_dropoff_datetime)

In [12]:
df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1,2.10,1,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5
1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1,0.20,1,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0
2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1,14.70,1,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0
3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0,10.60,1,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0
4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1,4.94,1,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2,2021-01-01 00:12:41,2021-01-01 00:26:47,1,4.13,1,N,161,226,1,14.5,0.5,0.5,3.66,0.0,0.3,21.96,2.5
96,2,2021-01-01 00:23:29,2021-01-01 00:35:03,2,4.12,1,N,162,74,2,13.5,0.5,0.5,0.00,0.0,0.3,17.30,2.5
97,2,2021-01-01 00:46:17,2021-01-01 00:54:25,2,2.22,1,N,144,170,1,9.0,0.5,0.5,2.56,0.0,0.3,15.36,2.5
98,2,2021-01-01 00:28:16,2021-01-01 00:51:44,1,7.11,1,N,264,264,2,23.5,0.5,0.5,0.00,0.0,0.3,24.80,0.0
99,2,2021-01-01 00:42:35,2021-01-01 00:54:41,3,1.61,1,N,229,237,2,9.5,0.5,0.5,0.00,0.0,0.3,13.30,2.5

In [13]:
df.head(n=0).to_sql(name=taxi_table_name, con=engine, if_exists='replace')

0

In [14]:
%time df.to_sql(name=taxi_table_name, con=engine, if_exists='append')

CPU times: user 9.36 ms, sys: 0 ns, total: 9.36 ms
Wall time: 13.6 ms

100

In [15]:
from time import time

In [16]:
while True: 

    try:
        t_start = time()
        
        df = next(df_iter)

        df.tpep_pickup_datetime = pd.to_datetime(df.tpep_pickup_datetime)
        df.tpep_dropoff_datetime = pd.to_datetime(df.tpep_dropoff_datetime)

        df.to_sql(name=taxi_table_name, con=engine, if_exists='append')

        t_end = time()

        print('inserted another chunk, took %.3f second' % (t_end - t_start))

    except StopIteration:
        print("Finished ingesting data into the postgres database")
        break

inserted another chunk, took 5.029 second
inserted another chunk, took 4.961 second
inserted another chunk, took 4.997 second
inserted another chunk, took 5.006 second
inserted another chunk, took 4.880 second
inserted another chunk, took 4.972 second
inserted another chunk, took 4.904 second
inserted another chunk, took 4.891 second
inserted another chunk, took 4.893 second
inserted another chunk, took 4.794 second
inserted another chunk, took 4.862 second
inserted another chunk, took 5.001 second
inserted another chunk, took 4.714 second
inserted another chunk, took 3.023 second
Finished ingesting data into the postgres database

low_memory=False after error message when ingesting:
"DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False."

Which column is column (6)?

In [17]:
query = """
SELECT "VendorID", "tpep_pickup_datetime", "tpep_dropoff_datetime", "passenger_count", "trip_distance", "RatecodeID", "store_and_fwd_flag"
FROM yellow_taxi_data
"""

df_sql = pd.read_sql(sql=query, con=engine)

In [30]:
df_sql.sample(10)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag
1102346,2.0,2021-01-28 00:08:19,2021-01-28 00:32:40,2.0,16.36,1.0,N
144563,2.0,2021-01-05 14:15:37,2021-01-06 13:32:48,1.0,1.74,1.0,N
343589,2.0,2021-01-10 09:39:31,2021-01-10 09:45:03,2.0,0.91,1.0,N
1265103,2.0,2021-01-31 17:58:53,2021-01-31 18:09:19,1.0,1.86,1.0,N
41984,2.0,2021-01-02 14:59:43,2021-01-02 15:18:13,1.0,1.37,1.0,N
540951,2.0,2021-01-14 17:35:11,2021-01-14 17:44:20,1.0,2.15,1.0,N
742827,1.0,2021-01-19 18:42:15,2021-01-19 18:51:21,1.0,1.90,1.0,N
129962,1.0,2021-01-05 10:49:20,2021-01-05 10:53:25,1.0,0.70,1.0,N
197949,1.0,2021-01-06 17:28:58,2021-01-06 18:06:43,1.0,2.50,1.0,N
1294982,NaN,2021-01-08 23:01:58,2021-01-09 00:01:03,NaN,9.66,NaN,None

In [19]:
df_sql.value_counts('RatecodeID', dropna=False)

RatecodeID
1.0     1249337
NaN       98352
2.0       14860
5.0        5212
4.0        1202
3.0         856
99.0         36
6.0          10
Name: count, dtype: int64

In [20]:
df_sql.value_counts('store_and_fwd_flag', dropna=False)

store_and_fwd_flag
N      1252528
NaN      98352
Y        18985
Name: count, dtype: int64

Note: seems that the mixed types means there's NaN and None that the engine takes a long time to infer, thus the memory warning.

Suggested solution: explitly specify the dTypes or `low_memory=False`, as the error message says. Opted for the low_memory setting as the transformations and data cleaning would be handled by Mage pipelines in the following weeks' lessons. So, no point doing it here.

## Ingest Zones table

In [21]:
# !wget "https://github.com/DataTalksClub/nyc-tlc-data/releases/download/misc/taxi_zone_lookup.csv"

In [22]:
df_zones = pd.read_csv('taxi+_zone_lookup.csv')

In [23]:
df_zones.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [24]:
df_zones.to_sql(name=zones_table_name, con=engine, if_exists='replace')

265

## Confirm upload by query from database instead of csv

In [25]:
query = """
SELECT COUNT(*) 
FROM yellow_taxi_data
"""

pd.read_sql(sql=query, con=engine)

     count
0  1369865

In [26]:
query = """
SELECT COUNT(*) 
FROM zones
"""

pd.read_sql(sql=query, con=engine)

   count
0    265